# InitialFluxIntensity Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InitialFluxIntensity Members
InitialFluxIntensity Class Constructors Methods Properties See Also
---
The InitialFluxIntensity type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InitialFluxIntensity(Double) | Creates an initial flux intensity object with the given document and flux values. |
| InitialFluxIntensity(InitialFluxIntensity) | Creates a copy of the given initial flux intensity object |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clone | Creates a copy of the InitialIntensity derived object.  (Inherited from InitialIntensity.) |
| Dispose | (Inherited from InitialIntensity.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Flux | The flux intensity value. |
| InitialIntensityValue | The calculated initial intensity value.  (Inherited from InitialIntensity.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from InitialIntensity.) |

# See Also
InitialFluxIntensity Class
Autodesk.Revit.DB.Lighting Namespace